/*
一群猴子要选新猴王。新猴王的选择方法是：让N只候选猴子围成一圈，从某位置起
顺序编号为1~N号。从第1号开始报数，每轮从1报到3，凡报到3的猴子即退出圈子，
接着又从紧邻的下一只猴子开始同样的报数。如此不断循环，最后剩下的一只猴子
就选为猴王。请问是原来第几号猴子当选猴王？
*/
#include<stdio.h>
int main()
{
    int n,c,m,x=0,a[1002]={0},i;
    scanf("%d",&n);
    c=1;
    while(x!=n-1){
        for(i=1;i<=n;i++)
        {
            if(a[i]==0){                
                if(c%3==0){
                    a[i]=1;
                    x++;
                }
                c++;
            }
        }
    }
    for(i=1;i<=n;i++){
        if(a[i]==0)
            printf("%d",i);
    }
    return 0;
}